IdeaRS.OpenModel.Message.WarningMessage
Open Warning message

IdeaRS.OpenModel.Message.WarningMessage.#ctor
Constructor

IdeaRS.OpenModel.Message.WarningMessage.#ctor(IdeaRS.OpenModel.Message.MessageNumber,IdeaRS.OpenModel.OpenObject,System.String,System.String,IdeaRS.OpenModel.Message.OpenMessage)
Constructor
number: Number of the message
description: Description of the message
openObject: Affected object
propertyName: Affected property
innerMessage: Inner message

IdeaRS.OpenModel.Message.WarningMessage.Message
Gets the Message